iesy-gmbh/iesy-osm-hardware/i.MX8M Mini OSM-SF/muxing/board/pin_mux.c
  - {pin_num: AF22, peripheral: SAI6, signal: 'sai_tx_data, 0', pin_signal: SAI1_TXD5}
  - {pin_num: AG23, peripheral: SAI6, signal: sai_tx_sync, pin_signal: SAI1_TXD6}
  - {pin_num: E6, peripheral: UART4, signal: uart_rx, pin_signal: ECSPI2_SCLK}
  - {pin_num: B8, peripheral: UART4, signal: uart_tx, pin_signal: ECSPI2_MOSI}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void) {                                /*!< Function assigned for the core: Cortex-A53[a53_0] */
    IOMUXC_SetPinMux(IOMUXC_ECSPI1_MISO_ECSPI1_MISO, 0U);
    IOMUXC_SetPinMux(IOMUXC_ECSPI1_MOSI_ECSPI1_MOSI, 0U);
    IOMUXC_SetPinMux(IOMUXC_ECSPI1_SCLK_ECSPI1_SCLK, 0U);
    IOMUXC_SetPinMux(IOMUXC_ECSPI1_SS0_ECSPI1_SS0, 0U);
    IOMUXC_SetPinMux(IOMUXC_ECSPI2_MOSI_UART4_TX, 0U);
    IOMUXC_SetPinMux(IOMUXC_ECSPI2_SCLK_UART4_RX, 0U);
    IOMUXC_SetPinMux(IOMUXC_ENET_MDC_ENET1_MDC, 0U);
    IOMUXC_SetPinMux(IOMUXC_ENET_MDIO_ENET1_MDIO, 0U);
    IOMUXC_SetPinMux(IOMUXC_ENET_RD0_ENET1_RGMII_RD0, 0U);
    IOMUXC_SetPinMux(IOMUXC_ENET_RD1_ENET1_RGMII_RD1, 0U);
    IOMUXC_SetPinMux(IOMUXC_ENET_RD2_ENET1_RGMII_RD2, 0U);
    IOMUXC_SetPinMux(IOMUXC_ENET_RD3_ENET1_RGMII_RD3, 0U);
    IOMUXC_SetPinMux(IOMUXC_ENET_RXC_ENET1_RGMII_RXC, 0U);
    IOMUXC_SetPinMux(IOMUXC_ENET_RX_CTL_ENET1_RGMII_RX_CTL, 0U);
    IOMUXC_SetPinMux(IOMUXC_ENET_TD0_ENET1_RGMII_TD0, 0U);
    IOMUXC_SetPinMux(IOMUXC_ENET_TD1_ENET1_RGMII_TD1, 0U);
    IOMUXC_SetPinMux(IOMUXC_ENET_TD2_ENET1_RGMII_TD2, 0U);
    IOMUXC_SetPinMux(IOMUXC_ENET_TD3_ENET1_RGMII_TD3, 0U);
    IOMUXC_SetPinMux(IOMUXC_ENET_TXC_ENET1_RGMII_TXC, 0U);
    IOMUXC_SetPinMux(IOMUXC_ENET_TX_CTL_ENET1_RGMII_TX_CTL, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO1_IO01_PWM1_OUT, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO1_IO06_USDHC1_CD_B, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO1_IO07_USDHC1_WP, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO1_IO12_USB1_OTG_PWR, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO1_IO13_USB1_OTG_OC, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO1_IO14_USB2_OTG_PWR, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO1_IO15_USB2_OTG_OC, 0U);
    IOMUXC_SetPinMux(IOMUXC_I2C1_SCL_I2C1_SCL, 0U);
    IOMUXC_SetPinMux(IOMUXC_I2C1_SDA_I2C1_SDA, 0U);
    IOMUXC_SetPinMux(IOMUXC_I2C2_SCL_I2C2_SCL, 0U);
    IOMUXC_SetPinMux(IOMUXC_I2C2_SDA_I2C2_SDA, 0U);
    IOMUXC_SetPinMux(IOMUXC_I2C3_SCL_I2C3_SCL, 0U);
    IOMUXC_SetPinMux(IOMUXC_I2C3_SDA_I2C3_SDA, 0U);
    IOMUXC_SetPinMux(IOMUXC_I2C4_SCL_PWM2_OUT, 0U);
    IOMUXC_SetPinMux(IOMUXC_NAND_ALE_QSPI_A_SCLK, 0U);
    IOMUXC_SetPinMux(IOMUXC_NAND_CE0_B_QSPI_A_SS0_B, 0U);
    IOMUXC_SetPinMux(IOMUXC_NAND_CE1_B_USDHC3_STROBE, 0U);
    IOMUXC_SetPinMux(IOMUXC_NAND_CE2_B_USDHC3_DATA5, 0U);
    IOMUXC_SetPinMux(IOMUXC_NAND_CE3_B_USDHC3_DATA6, 0U);
    IOMUXC_SetPinMux(IOMUXC_NAND_CLE_USDHC3_DATA7, 0U);
    IOMUXC_SetPinMux(IOMUXC_NAND_DATA00_QSPI_A_DATA0, 0U);
    IOMUXC_SetPinMux(IOMUXC_NAND_DATA01_QSPI_A_DATA1, 0U);
    IOMUXC_SetPinMux(IOMUXC_NAND_DATA02_QSPI_A_DATA2, 0U);
    IOMUXC_SetPinMux(IOMUXC_NAND_DATA03_QSPI_A_DATA3, 0U);
    IOMUXC_SetPinMux(IOMUXC_NAND_DATA04_USDHC3_DATA0, 0U);
    IOMUXC_SetPinMux(IOMUXC_NAND_DATA05_USDHC3_DATA1, 0U);
    IOMUXC_SetPinMux(IOMUXC_NAND_DATA06_USDHC3_DATA2, 0U);
    IOMUXC_SetPinMux(IOMUXC_NAND_DATA07_USDHC3_DATA3, 0U);
    IOMUXC_SetPinMux(IOMUXC_NAND_RE_B_USDHC3_DATA4, 0U);
    IOMUXC_SetPinMux(IOMUXC_NAND_WE_B_USDHC3_CLK, 0U);
    IOMUXC_SetPinMux(IOMUXC_NAND_WP_B_USDHC3_CMD, 0U);
    IOMUXC_SetPinMux(IOMUXC_SAI1_RXD5_SAI6_RX_DATA0, 0U);
    IOMUXC_SetPinMux(IOMUXC_SAI1_RXD7_SAI6_MCLK, 0U);
    IOMUXC_SetPinMux(IOMUXC_SAI1_TXD4_SAI6_TX_BCLK, 0U);
    IOMUXC_SetPinMux(IOMUXC_SAI1_TXD5_SAI6_TX_DATA0, 0U);
    IOMUXC_SetPinMux(IOMUXC_SAI1_TXD6_SAI6_TX_SYNC, 0U);
    IOMUXC_SetPinMux(IOMUXC_SAI2_RXD0_UART1_CTS_B, 0U);
    IOMUXC_SetPinMux(IOMUXC_SAI2_TXFS_UART1_RTS_B, 0U);
    IOMUXC_SetPinMux(IOMUXC_SD1_CLK_USDHC1_CLK, 0U);
    IOMUXC_SetPinMux(IOMUXC_SD1_CMD_USDHC1_CMD, 0U);
    IOMUXC_SetPinMux(IOMUXC_SD1_DATA0_USDHC1_DATA0, 0U);
    IOMUXC_SetPinMux(IOMUXC_SD1_DATA1_USDHC1_DATA1, 0U);
    IOMUXC_SetPinMux(IOMUXC_SD1_DATA2_USDHC1_DATA2, 0U);
    IOMUXC_SetPinMux(IOMUXC_SD1_DATA3_USDHC1_DATA3, 0U);
    IOMUXC_SetPinMux(IOMUXC_SD1_DATA4_USDHC1_DATA4, 0U);
    IOMUXC_SetPinMux(IOMUXC_SD1_DATA5_USDHC1_DATA5, 0U);
    IOMUXC_SetPinMux(IOMUXC_SD1_DATA6_USDHC1_DATA6, 0U);
    IOMUXC_SetPinMux(IOMUXC_SD1_DATA7_USDHC1_DATA7, 0U);
    IOMUXC_SetPinMux(IOMUXC_SD2_CD_B_USDHC2_CD_B, 0U);
    IOMUXC_SetPinMux(IOMUXC_SD2_CLK_USDHC2_CLK, 0U);
    IOMUXC_SetPinMux(IOMUXC_SD2_CMD_USDHC2_CMD, 0U);
    IOMUXC_SetPinMux(IOMUXC_SD2_DATA0_USDHC2_DATA0, 0U);
    IOMUXC_SetPinMux(IOMUXC_SD2_DATA1_USDHC2_DATA1, 0U);
    IOMUXC_SetPinMux(IOMUXC_SD2_DATA2_USDHC2_DATA2, 0U);
    IOMUXC_SetPinMux(IOMUXC_SD2_DATA3_USDHC2_DATA3, 0U);
    IOMUXC_SetPinMux(IOMUXC_SD2_WP_USDHC2_WP, 0U);
    IOMUXC_SetPinMux(IOMUXC_SPDIF_TX_PWM3_OUT, 0U);
    IOMUXC_SetPinMux(IOMUXC_UART1_RXD_UART1_RX, 0U);
    IOMUXC_SetPinMux(IOMUXC_UART1_TXD_UART1_TX, 0U);
    IOMUXC_SetPinMux(IOMUXC_UART2_RXD_UART2_RX, 0U);
    IOMUXC_SetPinMux(IOMUXC_UART2_TXD_UART2_TX, 0U);
    IOMUXC_SetPinMux(IOMUXC_UART3_RXD_UART3_RX, 0U);
    IOMUXC_SetPinMux(IOMUXC_UART3_TXD_UART3_TX, 0U);
    IOMUXC_SetPinMux(IOMUXC_UART4_RXD_UART2_CTS_B, 0U);
    IOMUXC_SetPinMux(IOMUXC_UART4_TXD_UART2_RTS_B, 0U);
}

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
